package homework7;

/**
 * Algorithms. Homework #7
 * @author Dmitry Chemel
 * @version 25 June 2023
 */

public class Questions {
/*
    1. Опишите как работает merge sort

    - Разделяем массив до того момента пока не будет все по одному элементу
    - потом соединяем по элементам и сортируем

    2. В чем отличие merge sort vs quick sort?

    - главное отличие это в устойчивости
    - quick sort - быстрее
    - merge sort - требует больше памяти

    3. Когда стоит применять merge sort?

    - когда большой массив и можно пренебречь памятью

    4. Merge sort устойчива ли?

    - да

    5. Вспомните все сортировки, которые проходили и выпишите асимптотическую сложность каждого из сортировок

    - сортировка пузырьком - O(n^2)
    - сортировка выбором - O(n^2)
    - сортировка вставками - O(n^2)
    - быстрая сортировка - O(n log n)
    - сортировка слиянием - O(n log n)

    6. Class - MergeSort
 */
}
