package homework1;

public class Questions {
//    Что такое алгоритм (можно своими словами)
//    Какие основные параметры алгоритма?
//    Какие основные способы описания алгоритма существуют?
//    Какие факторы учитываются при построении алгоритма? В чем они измеряются? Опишите алгоритм и напишите код для следующих задач (сделайте оценку сколько потребовалось памяти и времени):
//    Дан массив из 10 чисел (заполните любыми числами в промежутке от -100 до 100), необходимо найти сумму всех положительных чисел
//    Дан массив из 10 чисел, найдите средне-арифмитическое всех чисел
}
//        1 - Алгоритм - это решение задачи за короткое оптимальное количество времени и памяти
//        2 - Понятный, есть данные на вход, есть рузльтат, законченый процесс вычесления, выполнимый
//        3 - В голове(мысли), на бумаги(текст), псевдокод, блок=схема
//        4 - Время(кол-во операций) и пространство(память)