package homework6;

/**
 * Algorithms. Homework #6
 * @author Dmitry Chemel
 * @version 17 June 2023
 */

public class Questions {
    /*
    1. Какая идея алгоритма быстрой сортировки?
    - разбивка массива на подмассивы и сортировка их
    2. Какая асимптотическая сложность алгоритма быстрой сортировки?

    - O(n log n)
    3. Является ли алгоритм быстрой сортировки устойчивым алгоритмом?

    - нет, так ка устойчивость сортировки означает, что элементы  с одинаковым значенияси сохраня.т свой порядок

    4. Какие основные методы нужно реализовать в алгоритме быстрой сортировки? В каждой задаче оцените асимптотическую сложность по времени и по памяти

    - quickSort O(log n)
    - QuickSort O(n)
    - swap O(1)

    5. Class - GoodVersion
    6. Class - MergeArrays

    7. берем Pivot - например середина массива, относительного его сравниваем левую и правую.
    Меняем местами левую часть(больше pivot) с правой(меньше pivot)
    и снова запускаем алгоритм, пока грубо говоря массив не будет состоять из одних чисел

    8. Class - ReserveArray
    9. Class - MoveZeroElements

    Уровень 2:

    1. Class -

    2. Class -
*/

}
