package homework3;

public class Answers {

/*    1. Что такое рекурсия?

    Процесс, где вызывает сама себя

      2. Что такое стек?

    Область памяти, где хранять храняться значения примитивных данных, а
    также ссылки на объекты. Схема работы - певый зашел, последний вышел

      3. Какие типы рекурсии существуют? Каких нужно избегать?

    Прямая - вызывает сама себя. Косвенная - вызывает себя через другой метод

      4. Когда стоит выбрать рекурсию, а когда цикл(итерацию)?

    Если объем данных  в рекурсии будет не большой, то лучше ее.

      5. Что обязательно нужно учитывать/добавлять при работе с рекурсией?

    Условие остановки

      6. Напишите рекурсивный метод для нахождения факториала числа

    Task 1
 */
}
