package homework5;

/**
 * Algorithms. Homework #5
 * @author Dmitry Chemel
 * @version 13 June 2023
 */

public class Questions {
    /*
    1. Какие три операции лежат в основе алгоритма разделяй и властвуй?

    - разделить на задачи, решить задачи, объединить решение

    2. В чем преимущества и недостатки алгоритма разделяй и властвуй?

    - Сложное решается легко +
    - Обеспечивает многопроцессорность +
    - Занимает мало места +
    - Снижает временную сложность +

    - рекурсия, иногда замедляет -
    - зависит от логики реализации -
    - сбой из-за рекурсии -

    3. Опишите алгоритм бинарного поиска словами или псевдокодом

    - разделить сортированный массив на две части. Срванить число с первой половиной, если число меньше делим левую часть сново и т.д.

    4. Какова сложность бинарного поиска?

    - log n

    5. Попробуйте написать алгоритм бинарного поиска (мы в классе уже делали реализацию - попробуйте написать сами, а после посмотрите одно из решений

    - BinarySearch

    6.
     */
}
